<img width="443" alt="image" src="https://user-images.githubusercontent.com/50360031/213094137-ee8450b5-6d80-4f78-bc6c-37b0eca68db0.png">

```hcl
Terraform will perform the following actions:

  # ibm_cr_namespace.cr_namespace will be created
  + resource "ibm_cr_namespace" "cr_namespace" {
      + account               = (known after apply)
      + created_date          = (known after apply)
      + created_on            = (known after apply)
      + crn                   = (known after apply)
      + id                    = (known after apply)
      + name                  = "testpje-eufr-deux"
      + resource_created_date = (known after apply)
      + resource_group_id     = (known after apply)
      + updated_date          = (known after apply)
      + updated_on            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
2023-01-18T06:47:57.571+0100 [INFO]  backend/local: apply calling Apply
2023-01-18T06:47:57.571+0100 [DEBUG] Building and walking apply graph for NormalMode plan
2023-01-18T06:47:57.571+0100 [DEBUG] Resource state not found for node "ibm_cr_namespace.cr_namespace", instance ibm_cr_namespace.cr_namespace
2023-01-18T06:47:57.571+0100 [DEBUG] ProviderTransformer: "ibm_cr_namespace.cr_namespace (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ibm-cloud/ibm"]
2023-01-18T06:47:57.571+0100 [DEBUG] ProviderTransformer: "ibm_cr_namespace.cr_namespace" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ibm-cloud/ibm"]
2023-01-18T06:47:57.571+0100 [DEBUG] ReferenceTransformer: "ibm_cr_namespace.cr_namespace" references: []
2023-01-18T06:47:57.571+0100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/ibm-cloud/ibm\"]" references: []
2023-01-18T06:47:57.571+0100 [DEBUG] ReferenceTransformer: "ibm_cr_namespace.cr_namespace (expand)" references: []
2023-01-18T06:47:57.571+0100 [DEBUG] Starting graph walk: walkApply
2023-01-18T06:47:57.572+0100 [DEBUG] created provider logger: level=debug
2023-01-18T06:47:57.572+0100 [INFO]  provider: configuring client automatic mTLS
2023-01-18T06:47:57.579+0100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/ibm-cloud/ibm/1.49.0/darwin_arm64/terraform-provider-ibm_v1.49.0 args=[.terraform/providers/registry.terraform.io/ibm-cloud/ibm/1.49.0/darwin_arm64/terraform-provider-ibm_v1.49.0]
2023-01-18T06:47:57.585+0100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/ibm-cloud/ibm/1.49.0/darwin_arm64/terraform-provider-ibm_v1.49.0 pid=14703
2023-01-18T06:47:57.585+0100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/ibm-cloud/ibm/1.49.0/darwin_arm64/terraform-provider-ibm_v1.49.0
2023-01-18T06:47:57.616+0100 [DEBUG] provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:47:57 IBM Cloud Provider version 1.49.0  
2023-01-18T06:47:57.617+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: configuring server automatic mTLS: timestamp=2023-01-18T06:47:57.617+0100
2023-01-18T06:47:57.630+0100 [DEBUG] provider: using plugin: version=5
2023-01-18T06:47:57.630+0100 [DEBUG] provider.terraform-provider-ibm_v1.49.0: plugin address: network=unix address=/var/folders/tm/5wcxfkfx74b_n6sg86ktl0hw0000gp/T/plugin3505357490 timestamp=2023-01-18T06:47:57.630+0100
2023-01-18T06:47:57.710+0100 [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/ibm-cloud/ibm\"]" changed the config value, but that value is unused
2023-01-18T06:47:57.710+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:47:57 Configuring IBM Cloud Session with API key: timestamp=2023-01-18T06:47:57.710+0100
2023-01-18T06:47:57.710+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:47:57 [INFO] Configured Region: eu-fr2: timestamp=2023-01-18T06:47:57.710+0100
ibm_cr_namespace.cr_namespace: Creating...
2023-01-18T06:47:59.174+0100 [INFO]  Starting apply for ibm_cr_namespace.cr_namespace
2023-01-18T06:47:59.174+0100 [DEBUG] ibm_cr_namespace.cr_namespace: applying the planned Create change
2023-01-18T06:47:59.175+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:47:59 [Debug] Request:
POST /identity/token HTTP/1.1
Host: iam.cloud.ibm.com
User-Agent: Go-http-client/1.1
Content-Length: 135
Accept: application/json
Content-Type: application/x-www-form-urlencoded
Accept-Encoding: gzip

apikey=[redacted]&grant_type=urn%3Aibm%3Aparams%3Aoauth%3Agrant-type%3Aapikey&response_type=cloud_iam: timestamp=2023-01-18T06:47:59.175+0100
2023-01-18T06:47:59.175+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:47:59 [Debug] Invoking IAM 'get token' operation: https://iam.cloud.ibm.com/identity/token: timestamp=2023-01-18T06:47:59.175+0100
2023-01-18T06:48:00.701+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:00 [Debug] Returned from IAM 'get token' operation, received status code 200: timestamp=2023-01-18T06:48:00.700+0100
2023-01-18T06:48:00.712+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:00 [Debug] Response:
HTTP/1.1 200 OK
Transfer-Encoding: chunked
Akamai-Grn: 0.a687dd58.1674020880.428256d
Cache-Control: no-cache, no-store, must-revalidate
Connection: Keep-Alive
Content-Language: en-US
Content-Type: application/json
Date: Wed, 18 Jan 2023 05:48:00 GMT
Expires: 0
Pragma: no-cache
Strict-Transport-Security: max-age=31536000; includeSubDomains
Transaction-Id: cmxxNnQ-05f4f594062b4719be5460409e324ce2
X-Content-Type-Options: nosniff
X-Correlation-Id: cmxxNnQ-05f4f594062b4719be5460409e324ce2
X-Proxy-Upstream-Service-Time: 152
X-Request-Id: cebc47c7-7f56-4f37-80f7-4f42f11d2ef6

64e
{"access_token":"[redacted]","refresh_token":"[redacted]","ims_user_id":10316700,"token_type":"Bearer","expires_in":3600,"expiration":1674024477,"scope":"ibm openid"}
0
: timestamp=2023-01-18T06:48:00.712+0100
2023-01-18T06:48:00.713+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:00 [Debug] Request:
GET /v2/resource_groups?account_id=3f2cae45b0644f6d87aefcf404f5987f&default=true HTTP/1.1
Host: resource-controller.cloud.ibm.com
User-Agent: platform-services-go-sdk/0.31.0 (lang=go; arch=arm64; os=darwin; go.version=go1.18.9)
Accept: application/json
Authorization: [redacted]
X-Original-User-Agent: terraform-provider-ibm/1.49.0
Accept-Encoding: gzip
: timestamp=2023-01-18T06:48:00.713+0100
2023-01-18T06:48:00.713+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:00 [DEBUG] GET https://resource-controller.cloud.ibm.com/v2/resource_groups?account_id=3f2cae45b0644f6d87aefcf404f5987f&default=true: timestamp=2023-01-18T06:48:00.713+0100
2023-01-18T06:48:02.256+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:02 [Debug] Response:
HTTP/2.0 200 OK
Content-Length: 484
Cache-Control: max-age=0, no-cache, no-store
Content-Type: application/json; charset=utf-8
Date: Wed, 18 Jan 2023 05:48:02 GMT
Etag: W/"1e4-+xXqASLzQx0cIWeG6JYZug1WcEw"
Expires: Wed, 18 Jan 2023 05:48:02 GMT
Pragma: no-cache
Server: istio-envoy
Set-Cookie: ak_bmsc=FB40767BF213D5EBDE6D3A5945F73838~000000000000000000000000000000~YAAQjUISAgq+t8KFAQAAN4drwxIQ1GTtS/7z7hbrVVhyiDlEDA9vJrrLtvWZqaOf9DBXgD3AQnGueNLzZ8+eq3Ja8symzZenJdgSuyh4CWNriOqKe1hB1HrlByy/dYlfg0kn5KWT3mlGM+UUqovOIncxwi2Bz7fmw25poFk1d49H15w7iI0XLSSdpwbqm9UUAViKitNLm2vY3X0uW0Uawf4ZnrbB0sfkPI42KAcB3QjEHyLQX0joFvi2R8rcl91hQPH8yUUKdgnj9jdEMV+Lp1jsABiuVCgB6/d/7zMabFZNW2xCd9F3Z/RNjAAXsiJHoImi69X/KHw6XJkHTK+fo5H9KGtJmgCIENPz/megGvX7cPsB/HcMiJtz1P6C5OchbTuaLr9jmRXCjhoPrg==; Domain=.cloud.ibm.com; Path=/; Expires=Wed, 18 Jan 2023 07:48:02 GMT; Max-Age=7200; HttpOnly
Strict-Transport-Security: max-age=31536000; includeSubDomains
Transaction-Id: 6e88817fba41445cbaf86e8147a84782
Vary: Accept-Encoding
X-Content-Type-Options: nosniff
X-Envoy-Upstream-Service-Time: 126
X-Ratelimit-Limit: 60
X-Ratelimit-Remaining: 59
X-Ratelimit-Reset: 0
X-Request-Id: 6e88817fba41445cbaf86e8147a84782
X-Response-Time: 110.576ms
_request_id: 6e88817fba41445cbaf86e8147a84782

{"resources":[{"id":"831d5ea384384d8c9ed4743fffa4308f","crn":"crn:v1:bluemix:public:resource-controller::a/3f2cae45b0644f6d87aefcf404f5987f::resource-group:831d5ea384384d8c9ed4743fffa4308f","account_id":"3f2cae45b0644f6d87aefcf404f5987f","name":"Default","state":"ACTIVE","default":true,"quota_id":"a3d7b8d01e261c24677937c29ab33f3c","quota_url":"/v2/quota_definitions/a3d7b8d01e261c24677937c29ab33f3c","created_at":"2022-09-06T13:06:36.706Z","updated_at":"2022-09-06T13:06:36.706Z"}]}: timestamp=2023-01-18T06:48:02.253+0100
2023-01-18T06:48:02.256+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:02 [Debug] Request:
PUT /api/v1/namespaces/testpje-eufr-deux HTTP/1.1
Host: icr.io
User-Agent: container-registry-go-sdk/0.0.15 (lang=go; arch=arm64; os=darwin; go.version=go1.18.9)
Content-Length: 0
Accept: application/json
Account: 3f2cae45b0644f6d87aefcf404f5987f
Authorization: [redacted]
X-Auth-Resource-Group: [redacted]
X-Original-User-Agent: terraform-provider-ibm/1.49.0
Accept-Encoding: gzip
: timestamp=2023-01-18T06:48:02.254+0100
2023-01-18T06:48:02.256+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:02 [DEBUG] PUT https://icr.io/api/v1/namespaces/testpje-eufr-deux: timestamp=2023-01-18T06:48:02.254+0100
2023-01-18T06:48:05.025+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:05 [Debug] Response:
HTTP/2.0 201 Created
Content-Length: 41
Cache-Control: no-cache, no-store, must-revalidate
Content-Security-Policy: default-src 'self'; frame-ancestors 'none'; form-action 'none';
Content-Type: application/json
Date: Wed, 18 Jan 2023 05:48:04 GMT
Expires: 0
Pragma: no-cache
Server: IBM Cloud Container Registry
Strict-Transport-Security: max-age=31536000; includeSubDomains
X-Content-Type-Options: nosniff
X-Frame-Options: DENY
X-Request-Id: 5f401c48-5d0f-4ef8-81af-79e87c986e7b
X-Xss-Protection: 1; mode=block

{
    "namespace": "testpje-eufr-deux"
}: timestamp=2023-01-18T06:48:05.025+0100
2023-01-18T06:48:05.026+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:05 [Debug] Request:
GET /api/v1/namespaces/details HTTP/1.1
Host: icr.io
User-Agent: container-registry-go-sdk/0.0.15 (lang=go; arch=arm64; os=darwin; go.version=go1.18.9)
Accept: application/json
Account: 3f2cae45b0644f6d87aefcf404f5987f
Authorization: [redacted]
X-Original-User-Agent: terraform-provider-ibm/1.49.0
Accept-Encoding: gzip
: timestamp=2023-01-18T06:48:05.025+0100
2023-01-18T06:48:05.026+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:05 [DEBUG] GET https://icr.io/api/v1/namespaces/details: timestamp=2023-01-18T06:48:05.025+0100
2023-01-18T06:48:05.783+0100 [INFO]  provider.terraform-provider-ibm_v1.49.0: 2023/01/18 06:48:05 [Debug] Response:
HTTP/2.0 200 OK
Content-Length: 449
Cache-Control: no-cache, no-store, must-revalidate
Content-Security-Policy: default-src 'self'; frame-ancestors 'none'; form-action 'none';
Content-Type: application/json
Date: Wed, 18 Jan 2023 05:48:05 GMT
Expires: 0
Pragma: no-cache
Server: IBM Cloud Container Registry
Strict-Transport-Security: max-age=31536000; includeSubDomains
X-Content-Type-Options: nosniff
X-Frame-Options: DENY
X-Request-Id: 337e47c9-6374-470b-ae40-26f8fd5e3ea0
X-Xss-Protection: 1; mode=block

[
    {
        "name": "testpje-eufr-deux",
        "account": "3f2cae45b0644f6d87aefcf404f5987f",
        "crn": "crn:v1:bluemix:public:container-registry:global:a/3f2cae45b0644f6d87aefcf404f5987f::namespace:testpje-eufr-deux",
        "resource_group": "831d5ea384384d8c9ed4743fffa4308f",
        "resource_created_date": "2023-01-18 05:48:04",
        "created_date": "2023-01-18 05:48:04",
        "updated_date": "2023-01-18 05:48:04"
    }
]: timestamp=2023-01-18T06:48:05.783+0100
ibm_cr_namespace.cr_namespace: Creation complete after 7s [id=testpje-eufr-deux]
2023-01-18T06:48:05.795+0100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2023-01-18T06:48:05.798+0100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/ibm-cloud/ibm/1.49.0/darwin_arm64/terraform-provider-ibm_v1.49.0 pid=14703
2023-01-18T06:48:05.798+0100 [DEBUG] provider: plugin exited

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```